{
  "Workspace": "Think of your Scalekit workspace as your command center. It's where you manage all your applications and settings in one place.",
  "Application": "This is the software product or service you offer to your customers. You can have many applications in your Scalekit workspace.",
  "App": "Same as Application. It's the software product or service you sell to your customers.",
  "Environment": "Imagine different versions of your application, like a test version and a live version. Each environment has its own settings and is kept separate for security and organization.",
  "Team Member": "These are people from your company who use Scalekit to manage your application. They could be developers, product managers, or customer support staff.",
  "Dashboard": "This is the main control panel in Scalekit where your team members can configure settings, view analytics, and manage integrations for your application.",
  "Organization": "These are your customers. For example, if you sell to businesses, each business is an organization with its own users.",
  "Admin Portal": "This is a customizable web interface provided by Scalekit that allows your customers' IT administrators to set up and manage their Single Sign-On (SSO) connections.",
  "User": "This is an individual who uses your application. Users are typically part of a customer organization and may have different roles or permissions.",
  "Connection": "This is a link between your application and a customer's identity provider (like Okta or Azure AD) that enables Single Sign-On. Each customer organization can have its own unique connection.",
  "B2B App": "This is a business-to-business application that enables your customers, which are typically organizations or businesses, to use your product or service.",
  "B2B SaaS App": "Same as B2B App. It's your business-to-business software as a service that enables your customers to use your product or service.",
  "Customer": "In B2B, a customer is a business or organization that uses your application to streamline operations, enhance productivity, or achieve specific objectives.",
  "Administrator": "This is typically an IT administrator or an employee with IT responsibilities in a customer organization who manages the organization's identity provider and configures Single Sign-On (SSO) connections.",
  "IdP Simulator": "This is a tool that mimics the behavior of an identity provider, allowing you to test and validate your application's integration with various identity providers without needing a real one.",
  "Service Provider": "This is an organization that offers a product or service to another organization or individual. In the context of Single Sign-On (SSO), a service provider is an application that allows users to access its resources through a connection to an identity provider.",
  "Custom Attribute": "These are additional fields you can add to your user data in Scalekit to store extra information about your users, such as their department or location.",
  "Normalized Payload": "This is a standardized format for data sent from Scalekit to your application, ensuring that your application can easily understand and process the data.",
  "Directory Sync": "This is a module in Scalekit that allows you to automatically provision and deprovision user accounts based on events from your customers' directory provider.",
  "User Attribute": "These are properties or characteristics of a user. In Scalekit, user attributes are used to describe a user's identity and can be used for various purposes such as authentication, authorization, and access control.",
  "SAML Assertion": "This is a statement made by an identity provider that a user has been authenticated and is authorized to access a specific service provider.",
  "OIDC": "This is a standard protocol for authentication that builds on OAuth 2.0. It allows your application to verify the identity of a user and obtain basic profile information.",
  "OAuth": "This is a standard protocol for authorization that allows your application to obtain limited access to user data without needing to know the user's credentials.",
  "ID Token": "This is a JSON Web Token (JWT) that contains information about the user's identity, issued by the identity provider.",
  "Directory Provider": "This is an organization that provides directory services, typically including your customers' identity providers like Okta or Azure AD.",
  "Authorization URL": "This is the URL that the user is redirected to in order to authorize your application to access their account.",
  "Social Connection": "This is a connection that allows users to sign in to your application using their social media accounts.",
  "Identity Provider (IdP)": "This is a service that verifies the identity of a user and provides information about the user's attributes and permissions.",
  "Webhook": "This is a way for your application to receive notifications or updates from Scalekit, such as events about your customers' organizations, users, and other relevant information.",
  "SCIM": "This is a standard protocol for automating the provisioning and deprovisioning of user accounts and their attributes between an identity provider and a service provider."
}
