{
  "Workspace": "Your Scalekit account, where you manage all your applications and settings.",
  "Application": "A software product or service that you offer to your customers. You can have multiple applications in your Scalekit workspace.",
  "App": "A software product or service that you offer to your customers. You can have multiple applications in your Scalekit workspace.",
  "Environment": "A specific version or instance of your application, such as development, testing, or production. Each environment has its own settings and is kept separate from others for security and organization.",
  "Team Member": "Anyone from your company who uses Scalekit to manage your application. This could include developers, product managers, or customer support staff.",
  "Dashboard": "The main control panel in Scalekit where your team members can configure settings, view analytics, and manage integrations for your application.",
  "Organization": "Your customers. For example, if you sell to businesses, each business would be an organization and there are users in each organization.",
  "Admin Portal": "A customizable web interface provided by Scalekit that allows your customers' IT administrators to set up and manage their Single Sign-On (SSO) connections. This can be a standalone website or integrated into your application's settings.",
  "User": "An individual who uses your application. Users are typically part of a customer organization and may have different roles or permissions within your application.",
  "Connection": "A link between your application and a customer's identity provider (like Okta or Azure AD) that enables Single Sign-On. Each customer organization can have its own unique connection.",
  "B2B App": "A business-to-business (B2B) application that enables your customers, which are typically organizations or businesses, to utilize your product or service.",
  "B2B SaaS App": "Your business-to-business (B2B) software as a service that enables your customers, which are typically organizations or businesses, to utilize your product or service.",
  "Customer": "In B2B, a customer is a business or organization that uses your application to streamline operations, enhance productivity, or achieve specific objectives. B2B customers have unique requirements compared to individual consumers in B2C.",
  "Administrator": "Typically an IT administrator or an employee with IT responsibilities in a customer organization who is responsible for managing the organization's identity provider and configuring Single Sign-On (SSO) connections.",
  "IdP Simulator": "A tool that mimics the behavior of an identity provider, allowing you to test and validate your application's integration with various identity providers without the need for a real IdP. This can be useful for development, testing, or demonstration purposes.",
  "Service Provider": "A service provider is an organization that offers a product or service to another organization or individual. In the context of Single Sign-On (SSO), a service provider is an application that allows users to access its resources through a connection to an identity provider.",
  "Custom Attribute": "Custom attributes are additional fields that you can add (or map) to your user data in Scalekit. You can use custom attributes to store additional information about your users, such as their department, location, or other relevant information.",
  "Normalized Payload": "A standardized format for data sent from Scalekit to your application. This format ensures that your application can easily understand and process the data, regardless of the source of the event or the specific directory provider used by your customer.",
  "Directory Sync": "Directory sync is a module in Scalekit that allows you to automatically provision and deprovision user accounts based on events from your customers' directory provider.",
  "Connection": "A connection is a configuration that allows your application to authenticate users through an identity provider. Each connection has a source (like Okta or Azure AD) and a destination (like your application).",
  "User Attribute": "User attributes are the properties or characteristics of a user. In Scalekit, user attributes are used to describe a user's identity and can be used for various purposes such as authentication, authorization, and access control.",
  "SAML Assertion": "SAML (Security Assertion Markup Language) is a standard protocol for exchanging authentication and authorization data between an identity provider and a service provider. A SAML assertion is a statement made by the identity provider that the user has been authenticated and is authorized to access a specific service provider.",
  "OIDC": "OIDC (OpenID Connect) is a standard protocol for authentication that builds on OAuth 2.0. It allows your application to verify the identity of a user and obtain basic profile information, such as their email address, name, and other relevant information.",
  "OAuth": "OAuth (Open Authorization) is a standard protocol for authorization that allows your application to obtain limited access to user data without needing to know the user's credentials. OAuth is commonly used for authentication in modern web applications and APIs.",
  "ID Token": "An ID token is a JSON Web Token (JWT) that contains information about the user's identity. It is issued by the identity provider and contains information such as the user's email address, name, and other relevant information.",
  "Directory Provider": "A directory provider is an organization that provides directory services. Typically, includes your customers' identity providers like Okta, Azure AD, or others.",
  "Authorization URL": "The URL that the user is redirected to in order to authorize your application to access their account.",
  "Social Connection": "A connection that allows users to sign in to your application using their social media accounts (e.g., Google, Facebook, Twitter).",
  "Identity Provider (IdP)": "An identity provider is a service that verifies the identity of a user and provides information about the user's attributes and permissions. In the context of Single Sign-On (SSO), an identity provider is responsible for authenticating the user and providing the necessary information to the service provider (your application).",
  "Identity Provider": "An identity provider is a service that verifies the identity of a user and provides information about the user's attributes and permissions. In the context of Single Sign-On (SSO), an identity provider is responsible for authenticating the user and providing the necessary information to the service provider (your application).",
  "IdP": "An identity provider is a service that verifies the identity of a user and provides information about the user's attributes and permissions. In the context of Single Sign-On (SSO), an identity provider is responsible for authenticating the user and providing the necessary information to the service provider (your application).",
  "Webhook": "A webhook is a way for your application to receive notifications or updates from Scalekit. You can use webhooks to receive events about your customers' organizations, users, and other relevant information.",
  "SCIM": "SCIM (System for Cross-domain Identity Management) is a standard protocol for automating the provisioning and deprovisioning of user accounts and their attributes between an identity provider and a service provider. It allows for the synchronization of user data, such as roles and group memberships, between your application and your customers' identity providers."
}
