{
  "Workspace": "A Scalekit workspace is a centralized hub where B2B App developers manage their applications and settings. It serves as a command center for efficient application management.",
  "Application": "An application refers to the software product or service that B2B App developers offer to their customers. A Scalekit workspace can contain multiple applications.",
  "App": "An app is another term for an application. It represents the software product or service that B2B App developers sell to their customers.",
  "Environment": "Environments represent different versions or instances of an application, such as a test environment and a live environment. Each environment has its own settings and is isolated for security and organizational purposes.",
  "Team Member": "Team members are individuals from the B2B App developer's company who use Scalekit to manage their application. They can include developers, product managers, or customer support staff.",
  "Dashboard": "The dashboard is the main control panel within Scalekit where team members can configure settings, view analytics, and manage integrations for their application.",
  "Organization": "Organizations are the customers of B2B Apps. For example, if a B2B App sells to businesses, each business is considered an organization with its own set of users.",
  "Admin Portal": "The Admin Portal is a customizable web interface provided by Scalekit on behalf of the B2B App. It enables the customers' IT administrators to set up and manage their Identity Provider configurations.",
  "User": "A user is an individual who uses the B2B App. Users typically belong to a customer organization and may have different roles or permissions within the application.",
  "Connection": "A connection is a link established between the B2B App and a customer's identity provider (such as Okta or Azure AD) to enable Single Sign-On (SSO). Each customer organization can have its own unique connection.",
  "B2B App": "A B2B (Business-to-Business) App is an application designed for use by other businesses or organizations. These apps enable customers to streamline their operations, enhance productivity, or achieve specific objectives.",
  "B2B SaaS App": "A B2B SaaS (Software as a Service) App is a type of B2B App that is delivered over the internet. It allows customers to access and use the application without the need for local installation or maintenance.",
  "Customer": "In the context of B2B Apps, a customer refers to a business or organization that uses the application to meet their specific needs and goals.",
  "Administrator": "An administrator, typically an IT administrator or an employee with IT responsibilities within a customer (of B2B App) organization , is responsible for managing the organization's identity provider configurations.",
  "IdP Simulator": "An IdP (Identity Provider) Simulator is a tool that mimics the behavior of an identity provider. It allows B2B App developers to test and validate their application's integration with various identity providers without requiring a real one.",
  "Service Provider": "A service provider is an entity that offers a product or service to another organization or individual. In the context of Single Sign-On (SSO), a service provider is an application that allows users to access its resources through a connection to an identity provider.",
  "Custom Attribute": "Custom attributes are additional fields that B2B App developers can add to their user data in Scalekit to store extra information about users, such as their department or location.",
  "Normalized Payload": "A normalized payload is a standardized format for data sent from Scalekit to the B2B App. It ensures that the application can easily understand and process the received data.",
  "Directory Sync": "Directory Sync is a module in Scalekit that enables the automatic provisioning and deprovisioning of user accounts based on events from the customers' directory provider.",
  "User Attribute": "User attributes are properties or characteristics that describe a user's identity. In Scalekit, user attributes are used for various purposes, such as authentication, authorization, and access control.",
  "SAML Assertion": "A SAML (Security Assertion Markup Language) Assertion is a statement made by an identity provider indicating that a user has been authenticated and is authorized to access a specific service provider.",
  "OIDC": "OIDC (OpenID Connect) is a standard protocol for authentication that builds on OAuth 2.0. It allows B2B Apps to verify the identity of a user and obtain basic profile information.",
  "OAuth": "OAuth is a standard protocol for authorization that enables B2B Apps to obtain limited access to user data without requiring the user's credentials.",
  "ID Token": "An ID Token is a JSON Web Token (JWT) issued by the identity provider. It contains information about the user's identity.",
  "Directory Provider": "A directory provider is an organization that offers directory services, typically including the customers' identity providers like Okta or Azure AD.",
  "Authorization URL": "The Authorization URL is the URL to which the user is redirected to grant authorization for the B2B App to access their account.",
  "Social Connection": "A social connection allows users to sign in to the B2B App using their social media accounts.",
  "Identity Provider (IdP)": "An Identity Provider (IdP) is a service that verifies the identity of a user and provides information about the user's attributes and permissions.",
  "Webhook": "A webhook is a mechanism that allows the B2B App to receive notifications or updates from Scalekit, such as events related to customers' organizations, users, and other relevant information.",
  "SCIM": "SCIM (System for Cross-domain Identity Management) is a standard protocol for automating the provisioning and deprovisioning of user accounts and their attributes between an identity provider and a service provider."
}
